ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Миландр.1986VK025_OTP_Eclipse/Projects/Bootloader/svd/MLDR187_rev1.svd
                <register>
                    <name>CH3_CNTRL2</name>
                    <displayName>CH3_CNTRL2</displayName>
                    <description>CH3_CNTRL2 description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHSEL1</name>
                            <description>CHSEL1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CCR1_EN</name>
                            <description>CCR1_EN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRRRLD</name>
                            <description>CRRRLD description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_DELAY</name>
                            <description>EN_DELAY description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4_CNTRL2</name>
                    <displayName>CH4_CNTRL2</displayName>
                    <description>CH4_CNTRL2 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHSEL1</name>
                            <description>CHSEL1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CCR1_EN</name>
                            <description>CCR1_EN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRRRLD</name>
                            <description>CRRRLD description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_DELAY</name>
                            <description>EN_DELAY description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCR11</name>
                    <displayName>CCR11</displayName>
                    <description>CCR11 description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CCR21</name>
                    <displayName>CCR21</displayName>
                    <description>CCR21 description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CCR31</name>
                    <displayName>CCR31</displayName>
                    <description>CCR31 description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CCR41</name>
                    <displayName>CCR41</displayName>
                    <description>CCR41 description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DMA_RECH1</name>
                    <displayName>DMA_RECH1</displayName>
                    <description>DMA_RECH1 description</description>
                    <addressOffset>0x00000080</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVENT_RE</name>
                            <description>CNT_ZERO_EVENT_RE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVENT_RE</name>
                            <description>CNT_ARR_EVENT_RE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVENT_RE</name>
                            <description>ETR_RE_EVENT_RE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVENT_RE</name>
                            <description>ETR_FE_EVENT_RE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVENT_RE</name>
                            <description>BRK_EVENT_RE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVENT_RE</name>
                            <description>CCR_CAP_EVENT_RE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVENT_RE</name>
                            <description>CCR_REF_EVENT_RE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVENT_RE</name>
                            <description>CCR_CAP1_EVENT_RE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RECH2</name>
                    <displayName>DMA_RECH2</displayName>
                    <description>DMA_RECH2 description</description>
                    <addressOffset>0x00000084</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVENT_RE</name>
                            <description>CNT_ZERO_EVENT_RE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVENT_RE</name>
                            <description>CNT_ARR_EVENT_RE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVENT_RE</name>
                            <description>ETR_RE_EVENT_RE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVENT_RE</name>
                            <description>ETR_FE_EVENT_RE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVENT_RE</name>
                            <description>BRK_EVENT_RE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVENT_RE</name>
                            <description>CCR_CAP_EVENT_RE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVENT_RE</name>
                            <description>CCR_REF_EVENT_RE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVENT_RE</name>
                            <description>CCR_CAP1_EVENT_RE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RECH3</name>
                    <displayName>DMA_RECH3</displayName>
                    <description>DMA_RECH3 description</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVENT_RE</name>
                            <description>CNT_ZERO_EVENT_RE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVENT_RE</name>
                            <description>CNT_ARR_EVENT_RE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVENT_RE</name>
                            <description>ETR_RE_EVENT_RE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVENT_RE</name>
                            <description>ETR_FE_EVENT_RE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVENT_RE</name>
                            <description>BRK_EVENT_RE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVENT_RE</name>
                            <description>CCR_CAP_EVENT_RE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVENT_RE</name>
                            <description>CCR_REF_EVENT_RE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVENT_RE</name>
                            <description>CCR_CAP1_EVENT_RE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RECH4</name>
                    <displayName>DMA_RECH4</displayName>
                    <description>DMA_RECH4 description</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVENT_RE</name>
                            <description>CNT_ZERO_EVENT_RE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVENT_RE</name>
                            <description>CNT_ARR_EVENT_RE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVENT_RE</name>
                            <description>ETR_RE_EVENT_RE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVENT_RE</name>
                            <description>ETR_FE_EVENT_RE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVENT_RE</name>
                            <description>BRK_EVENT_RE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVENT_RE</name>
                            <description>CCR_CAP_EVENT_RE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVENT_RE</name>
                            <description>CCR_REF_EVENT_RE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVENT_RE</name>
                            <description>CCR_CAP1_EVENT_RE description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
