ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Миландр.1986VK025_OTP_Eclipse/Projects/Bootloader/svd/MLDR187_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EEPROM_CNTRL</name>
            <description>EEPROM_CNTRL description</description>
            <groupName>EEPROM_CNTRL</groupName>
            <baseAddress>0x40018000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>Registr upravlenija</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TMR</name>
                            <description>Bit perevoda pamjat' v testovyj rezhim</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NVSTR</name>
                            <description>Operacii zapisi ili stiranija</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG</name>
                            <description>Bit programirovanija pamjati pri dostupe v pamjat'</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAS1</name>
                            <description>Bit stiranija pamjati pri dostupe v pamjat'</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE</name>
                            <description>Bit stiranija pamjati pri dostupe v pamjat'</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IFREN</name>
                            <description>Bit vybora tipa pamjati pri dostupe v pamjat'</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>Bit razreshenija mladshej chasti adresa pri dostupe v pamjat' so storony registrov.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>YE</name>
                            <description>Bit razreshenija starshej chasti adresa pri dostupe v pamjat' so storony registrov.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XE</name>
                            <description>Bit razreshenija dostupa k bankam pamjati</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Delay</name>
                            <description>Zaderzhka pamjati programm pri chtenii v ciklah (v rabochem rezhime)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CON</name>
                            <description>Perekljuchenie kontrollera pamjati EEPROM na registrovoe upravlenie</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADR</name>
                    <displayName>ADR</displayName>
                    <description>ADR description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>XADR</name>
                            <description>XADR[8:0] = page[5:0], row[2:0]</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>YADR</name>
                            <description>YADR[6:0] = col[6:0]</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DI</name>
                    <displayName>DI</displayName>
                    <description>Dannye dlja zapisi v EERPOM</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DO</name>
                    <displayName>DO</displayName>
                    <description>Dannye, schitannye iz EERPOM</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>0x8AAA5551</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
