ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Миландр.1986VK025_OTP_Eclipse/Projects/Bootloader/svd/MLDR187_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CLK_MEASURE</name>
            <description>CLK_MEASURE description</description>
            <groupName>CLK_MEASURE</groupName>
            <baseAddress>0x400B0000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLK_CNTR_STAT</name>
                    <displayName>CLK_CNTR_STAT</displayName>
                    <description>Registr nastroek i sostojanija</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>KEY_RESET</name>
                            <description>KEY_RESET description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTERRUPT</name>
                            <description>INTERRUPT description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALARM_SHIFT_RST</name>
                    <displayName>ALARM_SHIFT_RST</displayName>
                    <description>Registr zadanija porogovyh znachenij dlja signala sbrosa</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BASE_REG2</name>
                            <description>BASE_REG2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG0</name>
                            <description>BASE_REG0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALARM_SHIFT_INT</name>
                    <displayName>ALARM_SHIFT_INT</displayName>
                    <description>Registr zadanija porogovyh znachenij dlja signala preryvanija</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BASE_REG3</name>
                            <description>BASE_REG3 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>BASE_REG1</name>
                            <description>BASE_REG1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALARM_PREG_0</name>
                    <displayName>ALARM_PREG_0</displayName>
                    <description>Registr nastrojki parametrov sbrosa schetchikov</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PREG0</name>
                            <description>PREG0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PREG1</name>
                            <description>PREG1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALARM_PREG_1</name>
                    <displayName>ALARM_PREG_1</displayName>
                    <description>Registr nastrojki parametrov sbrosa schetchikov</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PREG2</name>
                            <description>PREG2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PREG3</name>
                            <description>PREG3 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_STAT</name>
                    <displayName>CLK_STAT</displayName>
                    <description>Registr maksimal'nogo znachenija SHIFT_REG kazhdogo iz kanalov</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
